MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_lfss.h
/** @addtogroup LFSS_GEN_EVENT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001050) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) Interrupt clear */
} LFSS_GEN_EVENT_Regs;

/*@}*/ /* end of group LFSS_GEN_EVENT */

/** @addtogroup LFSS_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt Index Register */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} LFSS_CPU_INT_Regs;

/*@}*/ /* end of group LFSS_CPU_INT */

/** @addtogroup LFSS
  @{
*/

typedef struct {
       uint32_t RESERVED0[256];
  __IO uint32_t FSUB_0;                            /* !< (@ 0x00000400) Subsciber Port 0 */
       uint32_t RESERVED1[16];
  __IO uint32_t FPUB_0;                            /* !< (@ 0x00000444) Publisher Port 0 */
       uint32_t RESERVED2[751];
  __I  uint32_t CLKSEL;                            /* !< (@ 0x00001004) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED3[6];
  LFSS_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED4;
  LFSS_GEN_EVENT_Regs  GEN_EVENT;                         /* !< (@ 0x00001050) */
       uint32_t RESERVED5[25];
  __I  uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED6[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) LFSS Descriptor Register */
  LFSS_IPSPECIFIC_RTC_Regs  IPSPECIFIC_RTC;                    /* !< (@ 0x00001100) */
  LFSS_IPSPECIFIC_TIO_Regs  IPSPECIFIC_TIO;                    /* !< (@ 0x00001200) */
  LFSS_IPSPECIFIC_WDT_Regs  IPSPECIFIC_WDT;                    /* !< (@ 0x00001300) */
  LFSS_IPSPECIFIC_MEM_Regs  IPSPECIFIC_MEM;                    /* !< (@ 0x00001400) */
} LFSS_Regs;

/*@}*/ /* end of group LFSS */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* LFSS Register Control Bits
******************************************************************************/

/* LFSS_SPMEM Bits */
/* LFSS_SPMEM[DATA3] Bits */
#define LFSS_SPMEM_DATA3_OFS                     (24)                            /* !< DATA3 Offset */
#define LFSS_SPMEM_DATA3_MASK                    ((uint32_t)0xFF000000U)         /* !< memory data byte 3 */
#define LFSS_SPMEM_DATA3_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_SPMEM_DATA3_MAXIMUM                 ((uint32_t)0xFF000000U)         /* !< Highest possible value */
/* LFSS_SPMEM[DATA2] Bits */
#define LFSS_SPMEM_DATA2_OFS                     (16)                            /* !< DATA2 Offset */
#define LFSS_SPMEM_DATA2_MASK                    ((uint32_t)0x00FF0000U)         /* !< memory data byte 2 */
#define LFSS_SPMEM_DATA2_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_SPMEM_DATA2_MAXIMUM                 ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* LFSS_SPMEM[DATA1] Bits */
#define LFSS_SPMEM_DATA1_OFS                     (8)                             /* !< DATA1 Offset */
#define LFSS_SPMEM_DATA1_MASK                    ((uint32_t)0x0000FF00U)         /* !< memory data byte 1 */
#define LFSS_SPMEM_DATA1_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_SPMEM_DATA1_MAXIMUM                 ((uint32_t)0x0000FF00U)         /* !< Highest possible value */
/* LFSS_SPMEM[DATA0] Bits */
#define LFSS_SPMEM_DATA0_OFS                     (0)                             /* !< DATA0 Offset */
#define LFSS_SPMEM_DATA0_MASK                    ((uint32_t)0x000000FFU)         /* !< memory data byte 0 */
#define LFSS_SPMEM_DATA0_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_SPMEM_DATA0_MAXIMUM                 ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* LFSS_SPMWPROT0 Bits */
/* LFSS_SPMWPROT0[KEY] Bits */
#define LFSS_SPMWPROT0_KEY_OFS                   (24)                            /* !< KEY Offset */
#define LFSS_SPMWPROT0_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0xE8) to up2025-09-29
                                                                                    this register */
#define LFSS_SPMWPROT0_KEY_UNLOCK_W              ((uint32_t)0xE8000000U)         /* !< This field must be written with
                                                                                    0xE8 to be up2025-09-29 the write protect
                                                                                    bits. */
/* LFSS_SPMWPROT0[WP_3_3] Bits */
#define LFSS_SPMWPROT0_WP_3_3_OFS                (15)                            /* !< WP_3_3 Offset */
#define LFSS_SPMWPROT0_WP_3_3_MASK               ((uint32_t)0x00008000U)         /* !< write protect SPMEM3 - DATA3 */
#define LFSS_SPMWPROT0_WP_3_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_3_3_READONLY           ((uint32_t)0x00008000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_3_2] Bits */
#define LFSS_SPMWPROT0_WP_3_2_OFS                (14)                            /* !< WP_3_2 Offset */
#define LFSS_SPMWPROT0_WP_3_2_MASK               ((uint32_t)0x00004000U)         /* !< write protect SPMEM3 - DATA2 */
#define LFSS_SPMWPROT0_WP_3_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_3_2_READONLY           ((uint32_t)0x00004000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_3_1] Bits */
#define LFSS_SPMWPROT0_WP_3_1_OFS                (13)                            /* !< WP_3_1 Offset */
#define LFSS_SPMWPROT0_WP_3_1_MASK               ((uint32_t)0x00002000U)         /* !< write protect SPMEM3 - DATA1 */
#define LFSS_SPMWPROT0_WP_3_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_3_1_READONLY           ((uint32_t)0x00002000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_3_0] Bits */
#define LFSS_SPMWPROT0_WP_3_0_OFS                (12)                            /* !< WP_3_0 Offset */
#define LFSS_SPMWPROT0_WP_3_0_MASK               ((uint32_t)0x00001000U)         /* !< write protect SPMEM3 - DATA0 */
#define LFSS_SPMWPROT0_WP_3_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_3_0_READONLY           ((uint32_t)0x00001000U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_2_3] Bits */
#define LFSS_SPMWPROT0_WP_2_3_OFS                (11)                            /* !< WP_2_3 Offset */
#define LFSS_SPMWPROT0_WP_2_3_MASK               ((uint32_t)0x00000800U)         /* !< write protect SPMEM2 - DATA3 */
#define LFSS_SPMWPROT0_WP_2_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_2_3_READONLY           ((uint32_t)0x00000800U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_2_2] Bits */
#define LFSS_SPMWPROT0_WP_2_2_OFS                (10)                            /* !< WP_2_2 Offset */
#define LFSS_SPMWPROT0_WP_2_2_MASK               ((uint32_t)0x00000400U)         /* !< write protect SPMEM2 - DATA2 */
#define LFSS_SPMWPROT0_WP_2_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_2_2_READONLY           ((uint32_t)0x00000400U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_2_1] Bits */
#define LFSS_SPMWPROT0_WP_2_1_OFS                (9)                             /* !< WP_2_1 Offset */
#define LFSS_SPMWPROT0_WP_2_1_MASK               ((uint32_t)0x00000200U)         /* !< write protect SPMEM2 - DATA1 */
#define LFSS_SPMWPROT0_WP_2_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_2_1_READONLY           ((uint32_t)0x00000200U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_2_0] Bits */
#define LFSS_SPMWPROT0_WP_2_0_OFS                (8)                             /* !< WP_2_0 Offset */
#define LFSS_SPMWPROT0_WP_2_0_MASK               ((uint32_t)0x00000100U)         /* !< write protect SPMEM2 - DATA0 */
#define LFSS_SPMWPROT0_WP_2_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_2_0_READONLY           ((uint32_t)0x00000100U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_1_3] Bits */
#define LFSS_SPMWPROT0_WP_1_3_OFS                (7)                             /* !< WP_1_3 Offset */
#define LFSS_SPMWPROT0_WP_1_3_MASK               ((uint32_t)0x00000080U)         /* !< write protect SPMEM1 - DATA3 */
#define LFSS_SPMWPROT0_WP_1_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_1_3_READONLY           ((uint32_t)0x00000080U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_1_2] Bits */
#define LFSS_SPMWPROT0_WP_1_2_OFS                (6)                             /* !< WP_1_2 Offset */
#define LFSS_SPMWPROT0_WP_1_2_MASK               ((uint32_t)0x00000040U)         /* !< write protect SPMEM1 - DATA2 */
#define LFSS_SPMWPROT0_WP_1_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_1_2_READONLY           ((uint32_t)0x00000040U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_1_1] Bits */
#define LFSS_SPMWPROT0_WP_1_1_OFS                (5)                             /* !< WP_1_1 Offset */
#define LFSS_SPMWPROT0_WP_1_1_MASK               ((uint32_t)0x00000020U)         /* !< write protect SPMEM1 - DATA1 */
#define LFSS_SPMWPROT0_WP_1_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_1_1_READONLY           ((uint32_t)0x00000020U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_1_0] Bits */
#define LFSS_SPMWPROT0_WP_1_0_OFS                (4)                             /* !< WP_1_0 Offset */
#define LFSS_SPMWPROT0_WP_1_0_MASK               ((uint32_t)0x00000010U)         /* !< write protect SPMEM1 - DATA0 */
#define LFSS_SPMWPROT0_WP_1_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_1_0_READONLY           ((uint32_t)0x00000010U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_0_3] Bits */
#define LFSS_SPMWPROT0_WP_0_3_OFS                (3)                             /* !< WP_0_3 Offset */
#define LFSS_SPMWPROT0_WP_0_3_MASK               ((uint32_t)0x00000008U)         /* !< write protect SPMEM0 - DATA3 */
#define LFSS_SPMWPROT0_WP_0_3_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_0_3_READONLY           ((uint32_t)0x00000008U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_0_2] Bits */
#define LFSS_SPMWPROT0_WP_0_2_OFS                (2)                             /* !< WP_0_2 Offset */
#define LFSS_SPMWPROT0_WP_0_2_MASK               ((uint32_t)0x00000004U)         /* !< write protect SPMEM0 - DATA2 */
#define LFSS_SPMWPROT0_WP_0_2_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_0_2_READONLY           ((uint32_t)0x00000004U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_0_1] Bits */
#define LFSS_SPMWPROT0_WP_0_1_OFS                (1)                             /* !< WP_0_1 Offset */
#define LFSS_SPMWPROT0_WP_0_1_MASK               ((uint32_t)0x00000002U)         /* !< write protect SPMEM0 - DATA1 */
#define LFSS_SPMWPROT0_WP_0_1_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_0_1_READONLY           ((uint32_t)0x00000002U)         /* !< SPMEM is read only access */
/* LFSS_SPMWPROT0[WP_0_0] Bits */
#define LFSS_SPMWPROT0_WP_0_0_OFS                (0)                             /* !< WP_0_0 Offset */
#define LFSS_SPMWPROT0_WP_0_0_MASK               ((uint32_t)0x00000001U)         /* !< write protect SPMEM0 - DATA0 */
#define LFSS_SPMWPROT0_WP_0_0_READWRITE          ((uint32_t)0x00000000U)         /* !< SPMEM is read and write access */
#define LFSS_SPMWPROT0_WP_0_0_READONLY           ((uint32_t)0x00000001U)         /* !< SPMEM is read only access */

