MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_TOE11_8 Bits */
/* LFSS_TOE11_8[TIO8] Bits */
#define LFSS_TOE11_8_TIO8_OFS                    (0)                             /* !< TIO8 Offset */
#define LFSS_TOE11_8_TIO8_MASK                   ((uint32_t)0x00000001U)         /* !< Enables data output for tamper I/O
                                                                                    8 */
#define LFSS_TOE11_8_TIO8_DISABLE                ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE11_8_TIO8_ENABLE                 ((uint32_t)0x00000001U)         /* !< output enabled */
/* LFSS_TOE11_8[TIO9] Bits */
#define LFSS_TOE11_8_TIO9_OFS                    (8)                             /* !< TIO9 Offset */
#define LFSS_TOE11_8_TIO9_MASK                   ((uint32_t)0x00000100U)         /* !< Enables data output for tamper I/O
                                                                                    9 */
#define LFSS_TOE11_8_TIO9_DISABLE                ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE11_8_TIO9_ENABLE                 ((uint32_t)0x00000100U)         /* !< output enabled */
/* LFSS_TOE11_8[TIO10] Bits */
#define LFSS_TOE11_8_TIO10_OFS                   (16)                            /* !< TIO10 Offset */
#define LFSS_TOE11_8_TIO10_MASK                  ((uint32_t)0x00010000U)         /* !< Enables data output for tamper I/O
                                                                                    10 */
#define LFSS_TOE11_8_TIO10_DISABLE               ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE11_8_TIO10_ENABLE                ((uint32_t)0x00010000U)         /* !< output enabled */
/* LFSS_TOE11_8[TIO11] Bits */
#define LFSS_TOE11_8_TIO11_OFS                   (24)                            /* !< TIO11 Offset */
#define LFSS_TOE11_8_TIO11_MASK                  ((uint32_t)0x01000000U)         /* !< Enables data output for tamper I/O
                                                                                    11 */
#define LFSS_TOE11_8_TIO11_DISABLE               ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE11_8_TIO11_ENABLE                ((uint32_t)0x01000000U)         /* !< output enabled */

/* LFSS_TOE15_12 Bits */
/* LFSS_TOE15_12[TIO12] Bits */
#define LFSS_TOE15_12_TIO12_OFS                  (0)                             /* !< TIO12 Offset */
#define LFSS_TOE15_12_TIO12_MASK                 ((uint32_t)0x00000001U)         /* !< Enables data output for tamper I/O
                                                                                    12 */
#define LFSS_TOE15_12_TIO12_DISABLE              ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE15_12_TIO12_ENABLE               ((uint32_t)0x00000001U)         /* !< output enabled */
/* LFSS_TOE15_12[TIO13] Bits */
#define LFSS_TOE15_12_TIO13_OFS                  (8)                             /* !< TIO13 Offset */
#define LFSS_TOE15_12_TIO13_MASK                 ((uint32_t)0x00000100U)         /* !< Enables data output for tamper I/O
                                                                                    13 */
#define LFSS_TOE15_12_TIO13_DISABLE              ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE15_12_TIO13_ENABLE               ((uint32_t)0x00000100U)         /* !< output enabled */
/* LFSS_TOE15_12[TIO14] Bits */
#define LFSS_TOE15_12_TIO14_OFS                  (16)                            /* !< TIO14 Offset */
#define LFSS_TOE15_12_TIO14_MASK                 ((uint32_t)0x00010000U)         /* !< Enables data output for tamper I/O
                                                                                    14 */
#define LFSS_TOE15_12_TIO14_DISABLE              ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE15_12_TIO14_ENABLE               ((uint32_t)0x00010000U)         /* !< output enabled */
/* LFSS_TOE15_12[TIO15] Bits */
#define LFSS_TOE15_12_TIO15_OFS                  (24)                            /* !< TIO15 Offset */
#define LFSS_TOE15_12_TIO15_MASK                 ((uint32_t)0x01000000U)         /* !< Enables data output for tamper I/O
                                                                                    15 */
#define LFSS_TOE15_12_TIO15_DISABLE              ((uint32_t)0x00000000U)         /* !< output disabled */
#define LFSS_TOE15_12_TIO15_ENABLE               ((uint32_t)0x01000000U)         /* !< output enabled */

/* LFSS_TIN3_0 Bits */
/* LFSS_TIN3_0[TIO0] Bits */
#define LFSS_TIN3_0_TIO0_OFS                     (0)                             /* !< TIO0 Offset */
#define LFSS_TIN3_0_TIO0_MASK                    ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 0. */
#define LFSS_TIN3_0_TIO0_ZERO                    ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN3_0_TIO0_ONE                     ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* LFSS_TIN3_0[TIO1] Bits */
#define LFSS_TIN3_0_TIO1_OFS                     (8)                             /* !< TIO1 Offset */
#define LFSS_TIN3_0_TIO1_MASK                    ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 1. */
#define LFSS_TIN3_0_TIO1_ZERO                    ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN3_0_TIO1_ONE                     ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* LFSS_TIN3_0[TIO2] Bits */
#define LFSS_TIN3_0_TIO2_OFS                     (16)                            /* !< TIO2 Offset */
#define LFSS_TIN3_0_TIO2_MASK                    ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 2. */
#define LFSS_TIN3_0_TIO2_ZERO                    ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN3_0_TIO2_ONE                     ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* LFSS_TIN3_0[TIO3] Bits */
#define LFSS_TIN3_0_TIO3_OFS                     (24)                            /* !< TIO3 Offset */
#define LFSS_TIN3_0_TIO3_MASK                    ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 3. */
#define LFSS_TIN3_0_TIO3_ZERO                    ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN3_0_TIO3_ONE                     ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* LFSS_TIN7_4 Bits */
/* LFSS_TIN7_4[TIO4] Bits */
#define LFSS_TIN7_4_TIO4_OFS                     (0)                             /* !< TIO4 Offset */
#define LFSS_TIN7_4_TIO4_MASK                    ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 4. */
#define LFSS_TIN7_4_TIO4_ZERO                    ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN7_4_TIO4_ONE                     ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* LFSS_TIN7_4[TIO5] Bits */
#define LFSS_TIN7_4_TIO5_OFS                     (8)                             /* !< TIO5 Offset */
#define LFSS_TIN7_4_TIO5_MASK                    ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 5. */
#define LFSS_TIN7_4_TIO5_ZERO                    ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN7_4_TIO5_ONE                     ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* LFSS_TIN7_4[TIO6] Bits */
#define LFSS_TIN7_4_TIO6_OFS                     (16)                            /* !< TIO6 Offset */
#define LFSS_TIN7_4_TIO6_MASK                    ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 6. */
#define LFSS_TIN7_4_TIO6_ZERO                    ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN7_4_TIO6_ONE                     ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* LFSS_TIN7_4[TIO7] Bits */
#define LFSS_TIN7_4_TIO7_OFS                     (24)                            /* !< TIO7 Offset */
#define LFSS_TIN7_4_TIO7_MASK                    ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 7. */
#define LFSS_TIN7_4_TIO7_ZERO                    ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN7_4_TIO7_ONE                     ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* LFSS_TIN11_8 Bits */
/* LFSS_TIN11_8[TIO8] Bits */
#define LFSS_TIN11_8_TIO8_OFS                    (0)                             /* !< TIO8 Offset */
#define LFSS_TIN11_8_TIO8_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 8. */
#define LFSS_TIN11_8_TIO8_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN11_8_TIO8_ONE                    ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* LFSS_TIN11_8[TIO9] Bits */
#define LFSS_TIN11_8_TIO9_OFS                    (8)                             /* !< TIO9 Offset */
#define LFSS_TIN11_8_TIO9_MASK                   ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 9. */
#define LFSS_TIN11_8_TIO9_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN11_8_TIO9_ONE                    ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* LFSS_TIN11_8[TIO10] Bits */
#define LFSS_TIN11_8_TIO10_OFS                   (16)                            /* !< TIO10 Offset */
#define LFSS_TIN11_8_TIO10_MASK                  ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 10. */
#define LFSS_TIN11_8_TIO10_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN11_8_TIO10_ONE                   ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* LFSS_TIN11_8[TIO11] Bits */
#define LFSS_TIN11_8_TIO11_OFS                   (24)                            /* !< TIO11 Offset */
#define LFSS_TIN11_8_TIO11_MASK                  ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 11. */
#define LFSS_TIN11_8_TIO11_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN11_8_TIO11_ONE                   ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* LFSS_TIN15_12 Bits */
/* LFSS_TIN15_12[TIO12] Bits */
#define LFSS_TIN15_12_TIO12_OFS                  (0)                             /* !< TIO12 Offset */
#define LFSS_TIN15_12_TIO12_MASK                 ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 12. */
#define LFSS_TIN15_12_TIO12_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN15_12_TIO12_ONE                  ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* LFSS_TIN15_12[TIO13] Bits */
#define LFSS_TIN15_12_TIO13_OFS                  (8)                             /* !< TIO13 Offset */
#define LFSS_TIN15_12_TIO13_MASK                 ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 13. */
#define LFSS_TIN15_12_TIO13_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN15_12_TIO13_ONE                  ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* LFSS_TIN15_12[TIO14] Bits */
#define LFSS_TIN15_12_TIO14_OFS                  (16)                            /* !< TIO14 Offset */
#define LFSS_TIN15_12_TIO14_MASK                 ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 14. */
#define LFSS_TIN15_12_TIO14_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN15_12_TIO14_ONE                  ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* LFSS_TIN15_12[TIO15] Bits */
#define LFSS_TIN15_12_TIO15_OFS                  (24)                            /* !< TIO15 Offset */
#define LFSS_TIN15_12_TIO15_MASK                 ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of tamper I/O 15. */
#define LFSS_TIN15_12_TIO15_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define LFSS_TIN15_12_TIO15_ONE                  ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* LFSS_HEARTBEAT Bits */
/* LFSS_HEARTBEAT[HBINTERVAL] Bits */
#define LFSS_HEARTBEAT_HBINTERVAL_OFS            (0)                             /* !< HBINTERVAL Offset */
#define LFSS_HEARTBEAT_HBINTERVAL_MASK           ((uint32_t)0x00000007U)         /* !< Heart beat interval */
#define LFSS_HEARTBEAT_HBINTERVAL_HBINT0P125     ((uint32_t)0x00000000U)         /* !< Heart beat interval 0.125 sec */
#define LFSS_HEARTBEAT_HBINTERVAL_HBINT0P25      ((uint32_t)0x00000001U)         /* !< Heart beat interval 0.25 sec */
#define LFSS_HEARTBEAT_HBINTERVAL_HBINT0P5       ((uint32_t)0x00000002U)         /* !< Heart beat interval 0.5 sec */
#define LFSS_HEARTBEAT_HBINTERVAL_HBINT1         ((uint32_t)0x00000003U)         /* !< Heart beat interval 1 sec */
#define LFSS_HEARTBEAT_HBINTERVAL_HBINT2         ((uint32_t)0x00000004U)         /* !< Heart beat interval 2 sec */
#define LFSS_HEARTBEAT_HBINTERVAL_HBINT4         ((uint32_t)0x00000005U)         /* !< Heart beat interval 4 sec */
#define LFSS_HEARTBEAT_HBINTERVAL_HBINT8         ((uint32_t)0x00000006U)         /* !< Heart beat interval 8 sec */
#define LFSS_HEARTBEAT_HBINTERVAL_HBINT16        ((uint32_t)0x00000007U)         /* !< Heart beat interval 16 sec */
/* LFSS_HEARTBEAT[HBWIDTH] Bits */
#define LFSS_HEARTBEAT_HBWIDTH_OFS               (8)                             /* !< HBWIDTH Offset */
#define LFSS_HEARTBEAT_HBWIDTH_MASK              ((uint32_t)0x00000700U)         /* !< Heart beat interval width */
#define LFSS_HEARTBEAT_HBWIDTH_HBPWDTH1          ((uint32_t)0x00000000U)         /* !< Heart beat pulse width 1 msec */
#define LFSS_HEARTBEAT_HBWIDTH_HBPWDTH2          ((uint32_t)0x00000100U)         /* !< Heart beat pulse width 2 msec */
#define LFSS_HEARTBEAT_HBWIDTH_HBPWDTH4          ((uint32_t)0x00000200U)         /* !< Heart beat pulse width 4 msec */
#define LFSS_HEARTBEAT_HBWIDTH_HBPWDTH8          ((uint32_t)0x00000300U)         /* !< Heart beat pulse width 8 msec */
#define LFSS_HEARTBEAT_HBWIDTH_HBPWDTH16         ((uint32_t)0x00000400U)         /* !< Heart beat pulse width 16 msec */
#define LFSS_HEARTBEAT_HBWIDTH_HBPWDTH32         ((uint32_t)0x00000500U)         /* !< Heart beat pulse width 32 msec */
#define LFSS_HEARTBEAT_HBWIDTH_HBPWDTH64         ((uint32_t)0x00000600U)         /* !< Heart beat pulse width 64 msec */
#define LFSS_HEARTBEAT_HBWIDTH_HBPWDTH128        ((uint32_t)0x00000700U)         /* !< Heart beat pulse width 128 msec */
/* LFSS_HEARTBEAT[HBMODE] Bits */
#define LFSS_HEARTBEAT_HBMODE_OFS                (16)                            /* !< HBMODE Offset */
#define LFSS_HEARTBEAT_HBMODE_MASK               ((uint32_t)0x00030000U)         /* !< Heart beat mode */
#define LFSS_HEARTBEAT_HBMODE_HB_DIS             ((uint32_t)0x00000000U)         /* !< Heart beat disabled */
#define LFSS_HEARTBEAT_HBMODE_HB_ALLWAYS         ((uint32_t)0x00010000U)         /* !< Heart beat allways enabled */
#define LFSS_HEARTBEAT_HBMODE_HB_TS              ((uint32_t)0x00020000U)         /* !< Heart beat enabled when time stamp
                                                                                    event detected */
#define LFSS_HEARTBEAT_HBMODE_HB_VDDFAIL         ((uint32_t)0x00030000U)         /* !< Heart beat when VDD has fail
                                                                                    condition */

/* LFSS_TIOLOCK Bits */
/* LFSS_TIOLOCK[PROTECT] Bits */
#define LFSS_TIOLOCK_PROTECT_OFS                 (0)                             /* !< PROTECT Offset */
#define LFSS_TIOLOCK_PROTECT_MASK                ((uint32_t)0x00000001U)         /* !< If set, the register bit will
                                                                                    protect the TIOCTL and HEARTBEAT from
                                                                                    accidental writes. */
#define LFSS_TIOLOCK_PROTECT_CLR                 ((uint32_t)0x00000000U)         /* !< Tamper I/O control is writable. */
#define LFSS_TIOLOCK_PROTECT_SET                 ((uint32_t)0x00000001U)         /* !< Tamper I/O control is read only
                                                                                    access. */
/* LFSS_TIOLOCK[KEY] Bits */
#define LFSS_TIOLOCK_KEY_OFS                     (24)                            /* !< KEY Offset */
#define LFSS_TIOLOCK_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< need to write (KEY=0x18) to up2025-09-29
                                                                                    this register */
#define LFSS_TIOLOCK_KEY_UNLOCK_W                ((uint32_t)0x18000000U)         /* !< This field must be written with
                                                                                    0x18 to be able to clear any of the
                                                                                    enable bits */

/* LFSS_CLKCTL Bits */
/* LFSS_CLKCTL[MODCLKEN] Bits */
#define LFSS_CLKCTL_MODCLKEN_OFS                 (31)                            /* !< MODCLKEN Offset */
#define LFSS_CLKCTL_MODCLKEN_MASK                ((uint32_t)0x80000000U)         /* !< This bit enables the supply of the
                                                                                    32kHz clock to the RTC. It will not
                                                                                    power-up the 32kHz crystal oscillator
                                                                                    this needs to be done in the Clock
                                                                                    System Module. */
#define LFSS_CLKCTL_MODCLKEN_DISABLE             ((uint32_t)0x00000000U)         /* !< 32kHz clock is not supplied to the
                                                                                    RTC. */
#define LFSS_CLKCTL_MODCLKEN_ENABLE              ((uint32_t)0x80000000U)         /* !< 32kHz clock is supplied to the RTC. */

/* LFSS_DBGCTL Bits */
/* LFSS_DBGCTL[DBGRUN] Bits */
#define LFSS_DBGCTL_DBGRUN_OFS                   (0)                             /* !< DBGRUN Offset */
#define LFSS_DBGCTL_DBGRUN_MASK                  ((uint32_t)0x00000001U)         /* !< Debug Run. */
#define LFSS_DBGCTL_DBGRUN_HALT                  ((uint32_t)0x00000000U)         /* !< Counter is halted if CPU is in
                                                                                    debug state. */
#define LFSS_DBGCTL_DBGRUN_RUN                   ((uint32_t)0x00000001U)         /* !< Continue to operate normally
                                                                                    ignoring the debug state of the CPU. */
/* LFSS_DBGCTL[DBGINT] Bits */
#define LFSS_DBGCTL_DBGINT_OFS                   (1)                             /* !< DBGINT Offset */
#define LFSS_DBGCTL_DBGINT_MASK                  ((uint32_t)0x00000002U)         /* !< Debug Interrupt Enable. */
#define LFSS_DBGCTL_DBGINT_OFF                   ((uint32_t)0x00000000U)         /* !< Interrupts of the module will not
                                                                                    be captured anymore if CPU is in
                                                                                    debug state. Which means no up2025-09-29 to
                                                                                    the RTCRIS, RTCMISC and RTCIIDX
                                                                                    register. */
#define LFSS_DBGCTL_DBGINT_ON                    ((uint32_t)0x00000002U)         /* !< Interrupts are enabled in debug
                                                                                    mode. Interrupt requests are signaled
                                                                                    to the interrupt controller. If the
                                                                                    flags are required by software
                                                                                    (polling mode) the DGBINT bit need to
                                                                                    be set to 1. */

/* LFSS_CTL Bits */
/* LFSS_CTL[RTCTEVTX] Bits */
#define LFSS_CTL_RTCTEVTX_OFS                    (0)                             /* !< RTCTEVTX Offset */
#define LFSS_CTL_RTCTEVTX_MASK                   ((uint32_t)0x00000003U)         /* !< Real-time clock time event 0x0 =
                                                                                    Minute changed 0x1 = Hour changed 0x2
                                                                                    = Every day at midnight (00:00) 0x3 =
                                                                                    Every day at noon (12:00) */
#define LFSS_CTL_RTCTEVTX_MINUTE                 ((uint32_t)0x00000000U)         /* !< Generate RTC event every minute. */
#define LFSS_CTL_RTCTEVTX_HOUR                   ((uint32_t)0x00000001U)         /* !< Generate RTC event every hour. */
#define LFSS_CTL_RTCTEVTX_MIDNIGHT               ((uint32_t)0x00000002U)         /* !< Generate RTC event at midnight. */
#define LFSS_CTL_RTCTEVTX_NOON                   ((uint32_t)0x00000003U)         /* !< Generate RTC event at noon. */
/* LFSS_CTL[RTCBCD] Bits */
#define LFSS_CTL_RTCBCD_OFS                      (7)                             /* !< RTCBCD Offset */
#define LFSS_CTL_RTCBCD_MASK                     ((uint32_t)0x00000080U)         /* !< Real-time clock BCD select. Selects
                                                                                    BCD counting for real-time clock. */
#define LFSS_CTL_RTCBCD_BINARY                   ((uint32_t)0x00000000U)         /* !< Binary code selected */
#define LFSS_CTL_RTCBCD_BCD                      ((uint32_t)0x00000080U)         /* !< Binary coded decimal (BCD) code
                                                                                    selected */

