MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_EXTPSCTL Bits */
/* LFSS_EXTPSCTL[RT2PS] Bits */
#define LFSS_EXTPSCTL_RT2PS_OFS                  (2)                             /* !< RT2PS Offset */
#define LFSS_EXTPSCTL_RT2PS_MASK                 ((uint32_t)0x0000000CU)         /* !< Prescale timer 2 interrupt interval */
#define LFSS_EXTPSCTL_RT2PS_INT4S                ((uint32_t)0x00000000U)         /* !< Interval every 4 second */
#define LFSS_EXTPSCTL_RT2PS_INT8S                ((uint32_t)0x00000004U)         /* !< Interval every 8 second */
#define LFSS_EXTPSCTL_RT2PS_INT16S               ((uint32_t)0x00000008U)         /* !< Interval every 16 second */

/* LFSS_TSSEC Bits */
/* LFSS_TSSEC[SECBIN] Bits */
#define LFSS_TSSEC_SECBIN_OFS                    (0)                             /* !< SECBIN Offset */
#define LFSS_TSSEC_SECBIN_MASK                   ((uint32_t)0x0000003FU)         /* !< Time Stamp Second Binary (0 to 59).
                                                                                    If RTCBCD=1 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define LFSS_TSSEC_SECBIN_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSSEC_SECBIN_MAXIMUM                ((uint32_t)0x0000003BU)         /* !< Highest possible value */
/* LFSS_TSSEC[SECLOWBCD] Bits */
#define LFSS_TSSEC_SECLOWBCD_OFS                 (8)                             /* !< SECLOWBCD Offset */
#define LFSS_TSSEC_SECLOWBCD_MASK                ((uint32_t)0x00000F00U)         /* !< Time Stamp Seconds BCD  low digit
                                                                                    (0 to 9). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSSEC_SECLOWBCD_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSSEC_SECLOWBCD_MAXIMUM             ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_TSSEC[SECHIGHBCD] Bits */
#define LFSS_TSSEC_SECHIGHBCD_OFS                (12)                            /* !< SECHIGHBCD Offset */
#define LFSS_TSSEC_SECHIGHBCD_MASK               ((uint32_t)0x00007000U)         /* !< Time Stamp Seconds BCD  high digit
                                                                                    (0 to 5). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSSEC_SECHIGHBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSSEC_SECHIGHBCD_MAXIMUM            ((uint32_t)0x00005000U)         /* !< Highest possible value */

/* LFSS_TSMIN Bits */
/* LFSS_TSMIN[MINBIN] Bits */
#define LFSS_TSMIN_MINBIN_OFS                    (0)                             /* !< MINBIN Offset */
#define LFSS_TSMIN_MINBIN_MASK                   ((uint32_t)0x0000003FU)         /* !< Time Stamp Minutes Binary (0 to
                                                                                    59). If RTCBCD=1 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_TSMIN_MINBIN_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSMIN_MINBIN_MAXIMUM                ((uint32_t)0x0000003BU)         /* !< Highest possible value */
/* LFSS_TSMIN[MINLOWBCD] Bits */
#define LFSS_TSMIN_MINLOWBCD_OFS                 (8)                             /* !< MINLOWBCD Offset */
#define LFSS_TSMIN_MINLOWBCD_MASK                ((uint32_t)0x00000F00U)         /* !< Time Stamp Minutes BCD  low digit
                                                                                    (0 to 9). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSMIN_MINLOWBCD_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSMIN_MINLOWBCD_MAXIMUM             ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_TSMIN[MINHIGHBCD] Bits */
#define LFSS_TSMIN_MINHIGHBCD_OFS                (12)                            /* !< MINHIGHBCD Offset */
#define LFSS_TSMIN_MINHIGHBCD_MASK               ((uint32_t)0x00007000U)         /* !< Time Stamp Minutes BCD  high digit
                                                                                    (0 to 5). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSMIN_MINHIGHBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSMIN_MINHIGHBCD_MAXIMUM            ((uint32_t)0x00005000U)         /* !< Highest possible value */

/* LFSS_TSHOUR Bits */
/* LFSS_TSHOUR[HOURBIN] Bits */
#define LFSS_TSHOUR_HOURBIN_OFS                  (0)                             /* !< HOURBIN Offset */
#define LFSS_TSHOUR_HOURBIN_MASK                 ((uint32_t)0x0000001FU)         /* !< Time Stamp Hours Binary (0 to 23).
                                                                                    If RTCBCD=1 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define LFSS_TSHOUR_HOURBIN_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSHOUR_HOURBIN_MAXIMUM              ((uint32_t)0x00000017U)         /* !< Highest possible value */
/* LFSS_TSHOUR[HOURLOWBCD] Bits */
#define LFSS_TSHOUR_HOURLOWBCD_OFS               (8)                             /* !< HOURLOWBCD Offset */
#define LFSS_TSHOUR_HOURLOWBCD_MASK              ((uint32_t)0x00000F00U)         /* !< Time Stamp Hours BCD  low digit (0
                                                                                    to 9). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSHOUR_HOURLOWBCD_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSHOUR_HOURLOWBCD_MAXIMUM           ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_TSHOUR[HOURHIGHBCD] Bits */
#define LFSS_TSHOUR_HOURHIGHBCD_OFS              (12)                            /* !< HOURHIGHBCD Offset */
#define LFSS_TSHOUR_HOURHIGHBCD_MASK             ((uint32_t)0x00003000U)         /* !< Time Stamp Hours BCD  high digit (0
                                                                                    to 2). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSHOUR_HOURHIGHBCD_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSHOUR_HOURHIGHBCD_MAXIMUM          ((uint32_t)0x00002000U)         /* !< Highest possible value */

/* LFSS_TSDAY Bits */
/* LFSS_TSDAY[DOW] Bits */
#define LFSS_TSDAY_DOW_OFS                       (0)                             /* !< DOW Offset */
#define LFSS_TSDAY_DOW_MASK                      ((uint32_t)0x00000007U)         /* !< Time Stamp Day of week (0 to 6).
                                                                                    These bits are valid if RTCBCD=1 or
                                                                                    RTCBCD=0. */
#define LFSS_TSDAY_DOW_MINIMUM                   ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSDAY_DOW_MAXIMUM                   ((uint32_t)0x00000006U)         /* !< Highest possible value */
/* LFSS_TSDAY[DOMBIN] Bits */
#define LFSS_TSDAY_DOMBIN_OFS                    (8)                             /* !< DOMBIN Offset */
#define LFSS_TSDAY_DOMBIN_MASK                   ((uint32_t)0x00001F00U)         /* !< Time Stamp Day of month Binary (1
                                                                                    to 28, 29, 30, 31) If RTCBCD=1 write
                                                                                    to these bits will be ignored and
                                                                                    read give the value 0. */
#define LFSS_TSDAY_DOMBIN_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSDAY_DOMBIN_MAXIMUM                ((uint32_t)0x00001F00U)         /* !< Highest possible value */
/* LFSS_TSDAY[DOMLOWBCD] Bits */
#define LFSS_TSDAY_DOMLOWBCD_OFS                 (16)                            /* !< DOMLOWBCD Offset */
#define LFSS_TSDAY_DOMLOWBCD_MASK                ((uint32_t)0x000F0000U)         /* !< Time Stamp Day of month BCD  low
                                                                                    digit (0 to 9). If RTCBCD=0 write to
                                                                                    these bits will be ignored and read
                                                                                    give the value 0. */
#define LFSS_TSDAY_DOMLOWBCD_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSDAY_DOMLOWBCD_MAXIMUM             ((uint32_t)0x00090000U)         /* !< Highest possible value */
/* LFSS_TSDAY[DOMHIGHBCD] Bits */
#define LFSS_TSDAY_DOMHIGHBCD_OFS                (20)                            /* !< DOMHIGHBCD Offset */
#define LFSS_TSDAY_DOMHIGHBCD_MASK               ((uint32_t)0x00300000U)         /* !< Time Stamp Day of month BCD  high
                                                                                    digit (0 to 3). If RTCBCD=0 write to
                                                                                    these bits will be ignored and read
                                                                                    give the value 0. */
#define LFSS_TSDAY_DOMHIGHBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSDAY_DOMHIGHBCD_MAXIMUM            ((uint32_t)0x00300000U)         /* !< Highest possible value */

/* LFSS_TSMON Bits */
/* LFSS_TSMON[MONBIN] Bits */
#define LFSS_TSMON_MONBIN_OFS                    (0)                             /* !< MONBIN Offset */
#define LFSS_TSMON_MONBIN_MASK                   ((uint32_t)0x0000000FU)         /* !< Time Stamp Month Binary (1 to 12).
                                                                                    If RTCBCD=1 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define LFSS_TSMON_MONBIN_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSMON_MONBIN_MAXIMUM                ((uint32_t)0x0000000CU)         /* !< Highest possible value */
/* LFSS_TSMON[MONLOWBCD] Bits */
#define LFSS_TSMON_MONLOWBCD_OFS                 (8)                             /* !< MONLOWBCD Offset */
#define LFSS_TSMON_MONLOWBCD_MASK                ((uint32_t)0x00000F00U)         /* !< Time Stamp Month BCD  low digit (0
                                                                                    to 9). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSMON_MONLOWBCD_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSMON_MONLOWBCD_MAXIMUM             ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_TSMON[MONHIGHBCD] Bits */
#define LFSS_TSMON_MONHIGHBCD_OFS                (12)                            /* !< MONHIGHBCD Offset */
#define LFSS_TSMON_MONHIGHBCD_MASK               ((uint32_t)0x00001000U)         /* !< Time Stamp Month BCD  high digit (0
                                                                                    or 1). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSMON_MONHIGHBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSMON_MONHIGHBCD_MAXIMUM            ((uint32_t)0x00001000U)         /* !< Highest possible value */

/* LFSS_TSYEAR Bits */
/* LFSS_TSYEAR[YEARLOWBIN] Bits */
#define LFSS_TSYEAR_YEARLOWBIN_OFS               (0)                             /* !< YEARLOWBIN Offset */
#define LFSS_TSYEAR_YEARLOWBIN_MASK              ((uint32_t)0x000000FFU)         /* !< Time Stamp Year Binary  low byte.
                                                                                    Valid values for Year are 0 to 4095.
                                                                                    If RTCBCD=1 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define LFSS_TSYEAR_YEARLOWBIN_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSYEAR_YEARLOWBIN_MAXIMUM           ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* LFSS_TSYEAR[YEARHIGHBIN] Bits */
#define LFSS_TSYEAR_YEARHIGHBIN_OFS              (8)                             /* !< YEARHIGHBIN Offset */
#define LFSS_TSYEAR_YEARHIGHBIN_MASK             ((uint32_t)0x00000F00U)         /* !< Time Stamp Year Binary  high byte.
                                                                                    Valid values for Year are 0 to 4095.
                                                                                    If RTCBCD=1 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define LFSS_TSYEAR_YEARHIGHBIN_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSYEAR_YEARHIGHBIN_MAXIMUM          ((uint32_t)0x00000F00U)         /* !< Highest possible value */
/* LFSS_TSYEAR[YERARLOWESTBCD] Bits */
#define LFSS_TSYEAR_YERARLOWESTBCD_OFS           (16)                            /* !< YERARLOWESTBCD Offset */
#define LFSS_TSYEAR_YERARLOWESTBCD_MASK          ((uint32_t)0x000F0000U)         /* !< Time Stamp Year BCD  lowest digit
                                                                                    (0 to 9). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSYEAR_YERARLOWESTBCD_MINIMUM       ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSYEAR_YERARLOWESTBCD_MAXIMUM       ((uint32_t)0x00090000U)         /* !< Highest possible value */
/* LFSS_TSYEAR[DECADEBCD] Bits */
#define LFSS_TSYEAR_DECADEBCD_OFS                (20)                            /* !< DECADEBCD Offset */
#define LFSS_TSYEAR_DECADEBCD_MASK               ((uint32_t)0x00F00000U)         /* !< Time Stamp Decade BCD (0 to 9). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_TSYEAR_DECADEBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSYEAR_DECADEBCD_MAXIMUM            ((uint32_t)0x00900000U)         /* !< Highest possible value */
/* LFSS_TSYEAR[CENTLOWBCD] Bits */
#define LFSS_TSYEAR_CENTLOWBCD_OFS               (24)                            /* !< CENTLOWBCD Offset */
#define LFSS_TSYEAR_CENTLOWBCD_MASK              ((uint32_t)0x0F000000U)         /* !< Time Stamp Century BCD  low digit
                                                                                    (0 to 9). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSYEAR_CENTLOWBCD_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSYEAR_CENTLOWBCD_MAXIMUM           ((uint32_t)0x09000000U)         /* !< Highest possible value */
/* LFSS_TSYEAR[CENTHIGHBCD] Bits */
#define LFSS_TSYEAR_CENTHIGHBCD_OFS              (28)                            /* !< CENTHIGHBCD Offset */
#define LFSS_TSYEAR_CENTHIGHBCD_MASK             ((uint32_t)0x70000000U)         /* !< Time Stamp Century BCD  high digit
                                                                                    (0 to 4). If RTCBCD=0 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_TSYEAR_CENTHIGHBCD_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TSYEAR_CENTHIGHBCD_MAXIMUM          ((uint32_t)0x40000000U)         /* !< Highest possible value */

